import pandas as pd  # data processing, CSV file I/O (e.g. pd.read_csv)
pd.set_option('mode.chained_assignment',  None)

class data:

    def process():

        # 범죄 발생과 범죄 검거 상황 정제

        df = pd.read_csv("./dataset/범죄검거상황.csv", encoding='cp949', header=2, thousands=',')
        
        df = df[df["분류.3"] != "보험사기방지특별법"]
        del df["No"]
        del df["분류.1"]
        del df["분류.2"]
        del df["원자료.4"]
        del df["분류"]
                
        df.columns = ['통계년도', '범죄종류', '발생건수', '발생비', '검거건수', '검거율(%)', '남자', '여자', '미상']

        df["발생건수"] = df["발생건수"].astype(int)
        df["검거건수"] = df["검거건수"].astype(int)
        df["남자"] = df["남자"].astype(int)
        df["여자"] = df["여자"].astype(int)
        df["미상"] = df["미상"].astype(int)
        df["검거율(%)"] = df["검거율(%)"].round(3)

        df.loc[df['통계년도']=='2014년', '통계년도']='2014-01-01'
        df.loc[df['통계년도']=='2015년', '통계년도']='2015-01-01'
        df.loc[df['통계년도']=='2016년', '통계년도']='2016-01-01'
        df.loc[df['통계년도']=='2017년', '통계년도']='2017-01-01'
        df.loc[df['통계년도']=='2018년', '통계년도']='2018-01-01'
        df.loc[df['통계년도']=='2019년', '통계년도']='2019-01-01'

        # df.to_csv("./dataset/crime_circumstance.csv", index=False)

        # 범죄 검거까지 기간 데이터 정제

        df1 = pd.read_csv("./dataset/범죄검거기간.csv", encoding='cp949', header=2, thousands=',')

        df1 = df1[df1["분류.1"] != "강간·강제추행"]

        del df1["분류"]
        del df1["원자료.10"]
        del df1["원자료"]
        del df1["No"]

        df1.columns = ['통계년도', '범죄종류', '1일이내', '2일이내', '3일이내', '10일이내', '1개월이내', '3개월이내', '6개월이내', '1년이내', '1년초과']

        df1["1일이내"] = df1["1일이내"].astype(int)
        df1["2일이내"] = df1["2일이내"].astype(int)
        df1["3일이내"] = df1["3일이내"].astype(int)
        df1["10일이내"] = df1["10일이내"].astype(int)
        df1["1개월이내"] = df1["1개월이내"].astype(int)
        df1["3개월이내"] = df1["3개월이내"].astype(int)
        df1["6개월이내"] = df1["6개월이내"].astype(int)
        df1["1년이내"] = df1["1년이내"].astype(int)
        df1["1년초과"] = df1["1년초과"].astype(int)

        df1.loc[df1['통계년도']=='2014년', '통계년도']='2014-01-01'
        df1.loc[df1['통계년도']=='2015년', '통계년도']='2015-01-01'
        df1.loc[df1['통계년도']=='2016년', '통계년도']='2016-01-01'
        df1.loc[df1['통계년도']=='2017년', '통계년도']='2017-01-01'
        df1.loc[df1['통계년도']=='2018년', '통계년도']='2018-01-01'
        df1.loc[df1['통계년도']=='2019년', '통계년도']='2019-01-01'


        # df1.to_csv("./dataset/crime_duringday.csv", index=False)


        # 범죄자의 금전소비 용도 데이터 정제

        df2 = pd.read_csv("./dataset/금전소비용도.csv", encoding='cp949', header=2, thousands=',')

        df2 = df2[df2["분류"] != "계"]

        del df2["No"]
        del df2["분류"]
        del df2["원자료"]
        del df2["분류.1"]

        df2.columns = ["통계년도", "범죄종류", "유흥", "오락", "생활비", "도박", "학비", "증여", "소지중", "기타", "미상"]


        df2.loc[df2['통계년도']=='2014년', '통계년도']='2014-01-01'
        df2.loc[df2['통계년도']=='2015년', '통계년도']='2015-01-01'
        df2.loc[df2['통계년도']=='2016년', '통계년도']='2016-01-01'
        df2.loc[df2['통계년도']=='2017년', '통계년도']='2017-01-01'
        df2.loc[df2['통계년도']=='2018년', '통계년도']='2018-01-01'
        df2.loc[df2['통계년도']=='2019년', '통계년도']='2019-01-01'

        # df2.to_csv("./dataset/crime_money.csv", index=False)



        # 범죄자 범행시 정신 상태 정제

        df3 = pd.read_csv("./dataset/범죄자범행시정신상태.csv", encoding='cp949', header=2, thousands=',')

        del df3["No"]
        del df3["분류"]
        del df3["분류.1"]
        del df3["계"]
        del df3["남자(계)"]
        del df3["여자(계)"]
        del df3["정상(남)"]
        del df3["정상(여)"]
        del df3["정신이상(소계)"]
        del df3["정신이상(남)"]
        del df3["정신이상(여)"]
        del df3["정신박약(소계)"]
        del df3["정신박약(남)"]
        del df3["정신박약(여)"]
        del df3["기타정신장애(소계)"]
        del df3["기타정신장애(남)"]
        del df3["기타정신장애(여)"]
        del df3["주취(남)"]
        del df3["주취(여)"]
        del df3["월경시이상"]

        df3 = df3[df3["자료시점"] != "자료시점"]
        df3.columns = ['통계년도', '범죄종류', '정상', '정신장애', '주취', '미상']

        df3["정상"] = df3["정상"].apply(lambda x: x.replace(',', ''))
        df3["정신장애"] = df3["정신장애"].apply(lambda x: x.replace(',', ''))
        df3["주취"] = df3["주취"].apply(lambda x: x.replace(',', ''))
        df3["미상"] = df3["미상"].apply(lambda x: x.replace(',', ''))

        df3["정상"] = df3["정상"].astype(int)
        df3["정신장애"] = df3["정신장애"].astype(int)
        df3["주취"] = df3["주취"].astype(int)
        df3["미상"] = df3["미상"].astype(int)

        df3.loc[df3['통계년도']=='2014년', '통계년도']='2014-01-01'
        df3.loc[df3['통계년도']=='2015년', '통계년도']='2015-01-01'
        df3.loc[df3['통계년도']=='2016년', '통계년도']='2016-01-01'
        df3.loc[df3['통계년도']=='2017년', '통계년도']='2017-01-01'
        df3.loc[df3['통계년도']=='2018년', '통계년도']='2018-01-01'
        df3.loc[df3['통계년도']=='2019년', '통계년도']='2019-01-01'


        # df3.to_csv("./dataset/crime_mental.csv", index=False)


        # 범죄자 성별 데이터 정제

        df4 = pd.read_csv("./dataset/범죄자성.csv", encoding='cp949', header=2, thousands=',')

        del df4["No"]
        del df4["분류"]
        del df4["분류.1"]
        del df4["원자료"]
        del df4["원자료.4"]

        df4.columns = ['통계년도', '범죄종류', '남자', '여자', '미상']


        df4.loc[df4['통계년도']=='2014년', '통계년도']='2014-01-01'
        df4.loc[df4['통계년도']=='2015년', '통계년도']='2015-01-01'
        df4.loc[df4['통계년도']=='2016년', '통계년도']='2016-01-01'
        df4.loc[df4['통계년도']=='2017년', '통계년도']='2017-01-01'
        df4.loc[df4['통계년도']=='2018년', '통계년도']='2018-01-01'
        df4.loc[df4['통계년도']=='2019년', '통계년도']='2019-01-01'
        

        # df4.to_csv("./dataset/crime_sex.csv", index=False)


        # 범죄자 전과 정보 데이터 정제

        df5 = pd.read_csv("./dataset/범죄자전과.csv", encoding='cp949', header=3, thousands=',')


        del df5["No"]
        del df5["분류"]
        del df5["분류.1"]
        del df5["원자료"]
        del df5["원자료.2"]

        df5.columns = ['통계년도', '범죄종류', '전과없음', '전과1범', '전과2범', '전과3범', '전과4범', '전과5범', '전과6범', '전과7범', '전과8범', '전과9범이상', '미상']


        df5.loc[df5['통계년도']=='2014년', '통계년도']='2014-01-01'
        df5.loc[df5['통계년도']=='2015년', '통계년도']='2015-01-01'
        df5.loc[df5['통계년도']=='2016년', '통계년도']='2016-01-01'
        df5.loc[df5['통계년도']=='2017년', '통계년도']='2017-01-01'
        df5.loc[df5['통계년도']=='2018년', '통계년도']='2018-01-01'
        df5.loc[df5['통계년도']=='2019년', '통계년도']='2019-01-01'

        # df5.to_csv("./dataset/crime_conviction.csv", index=False)


        # 피해자 연령 데이터 정제

        df6 = pd.read_csv("./dataset/피해자성별연령.csv", encoding='cp949', header=3, thousands=',')


        del df6["No"]
        del df6["분류"]
        del df6["분류.1"]
        del df6["원자료.1"]
        del df6["원자료.12"]
        del df6["원자료.23"]
        del df6["원자료"]

        df6.columns = ['통계년도', '범죄종류', '남자6세이하', '남자12세이하', '남자15세이하', '남자20세이하', '남자30세이하', '남자40세이하', '남자50세이하','남자60세이하', '남자60세초과', '남자미상', '여자6세이하', '여자12세이하', '여자15세이하', '여자20세이하', '여자30세이하', '여자40세이하', '여자50세이하', '여자60세이하', '여자60세초과', '여자미상']

        df6["6세이하"] = df6["남자6세이하"] + df6["여자6세이하"] 
        df6["12세이하"] = df6["남자12세이하"] + df6["여자12세이하"]
        df6["15세이하"] = df6["남자15세이하"] + df6["여자15세이하"] 
        df6["20세이하"] = df6["남자20세이하"] + df6["여자20세이하"]
        df6["30세이하"] = df6["남자30세이하"] + df6["여자30세이하"] 
        df6["40세이하"] = df6["남자40세이하"] + df6["여자40세이하"] 
        df6["50세이하"] = df6["남자50세이하"] + df6["여자50세이하"] 
        df6["60세이하"] = df6["남자60세이하"] + df6["여자60세이하"] 
        df6["60세초과"] = df6["남자60세초과"] + df6["여자60세초과"] 
        df6["미상"] = df6["남자미상"] + df6["여자미상"]        

        del df6["남자6세이하"]
        del df6["남자12세이하"]
        del df6["남자15세이하"]
        del df6["남자20세이하"]
        del df6["남자30세이하"]
        del df6["남자40세이하"]
        del df6["남자50세이하"]
        del df6["남자60세이하"]
        del df6["남자60세초과"]
        del df6["남자미상"]
        del df6["여자6세이하"]
        del df6["여자12세이하"]
        del df6["여자15세이하"]
        del df6["여자20세이하"]
        del df6["여자30세이하"]
        del df6["여자40세이하"]
        del df6["여자50세이하"]
        del df6["여자60세이하"]
        del df6["여자60세초과"]
        del df6["여자미상"]


        df6.loc[df6['통계년도']=='2014년', '통계년도']='2014-01-01'
        df6.loc[df6['통계년도']=='2015년', '통계년도']='2015-01-01'
        df6.loc[df6['통계년도']=='2016년', '통계년도']='2016-01-01'
        df6.loc[df6['통계년도']=='2017년', '통계년도']='2017-01-01'
        df6.loc[df6['통계년도']=='2018년', '통계년도']='2018-01-01'
        df6.loc[df6['통계년도']=='2019년', '통계년도']='2019-01-01'


        # df6.to_csv("./dataset/crime_age.csv", index=False)
        

        # 범죄자와 피해자의 관계 데이터 정제

        df7 = pd.read_csv("./dataset/범죄자와피해자의관계.csv", encoding='cp949', header=2, thousands=',')


        del df7["No"]
        del df7["분류"]
        del df7["분류.1"]

        df7.columns = ['통계년도', '범죄종류', '합계','국가', '공무원', '고용자', '피고용자', '직장동료', '친구', '애인', '동거친족', '기타친족', '거래상대방', '이웃', '지인', '타인', '기타', '미상']


        df7.loc[df7['통계년도']=='2014년', '통계년도']='2014-01-01'
        df7.loc[df7['통계년도']=='2015년', '통계년도']='2015-01-01'
        df7.loc[df7['통계년도']=='2016년', '통계년도']='2016-01-01'
        df7.loc[df7['통계년도']=='2017년', '통계년도']='2017-01-01'
        df7.loc[df7['통계년도']=='2018년', '통계년도']='2018-01-01'
        df7.loc[df7['통계년도']=='2019년', '통계년도']='2019-01-01'


        # df7.to_csv("./dataset/crime_relation.csv", index=False)



        # 범죄발생시간 데이터 정제

        df8 = pd.read_csv("./dataset/범죄발생시간.csv", encoding='cp949', header=2, thousands=',')

        del df8["No"]
        del df8["분류"]
        del df8["분류.1"]

        df8.columns = ['통계년도', '범죄종류', '합계', '00:00~02:59', '03:00~05:59', '06:00~08:59', '09:00~11:59', '12:00~ 14:59', '15:00~17:59', '18:00~20:59', '21:00~23:59', '미상']


        df8.loc[df8['통계년도']=='2014년', '통계년도']='2014-01-01'
        df8.loc[df8['통계년도']=='2015년', '통계년도']='2015-01-01'
        df8.loc[df8['통계년도']=='2016년', '통계년도']='2016-01-01'
        df8.loc[df8['통계년도']=='2017년', '통계년도']='2017-01-01'
        df8.loc[df8['통계년도']=='2018년', '통계년도']='2018-01-01'
        df8.loc[df8['통계년도']=='2019년', '통계년도']='2019-01-01'

        # df8.to_csv("./dataset/crime_time.csv", index=False)


        # 범죄발생 장소 데이터 정제

        df9 = pd.read_csv("./dataset/범죄발생장소.csv", encoding='cp949', header=2, thousands=',')

        del df9['No']
        del df9['분류']
        del df9['분류.1']

        df9.columns = ['통계년도', '범죄종류', '합계', '아파트', '단독주택', '고속도로', '노상', '상점', '시장노점', '숙밥업소 목욕탕', '유흥접객업소', '사무실', '공장', '공사장광산', '창고', '역대합실', '지하철', '기타교통수단내', '흥행장', '유원지', '학교', '금융기관', '의료기관', '종교기관', '산야', '해상', '부대', '구금장소', '공지', '기타']

        df9.loc[df9['통계년도']=='2014년', '통계년도']='2014-01-01'
        df9.loc[df9['통계년도']=='2015년', '통계년도']='2015-01-01'
        df9.loc[df9['통계년도']=='2016년', '통계년도']='2016-01-01'
        df9.loc[df9['통계년도']=='2017년', '통계년도']='2017-01-01'
        df9.loc[df9['통계년도']=='2018년', '통계년도']='2018-01-01'
        df9.loc[df9['통계년도']=='2019년', '통계년도']='2019-01-01'

        # df9.to_csv("./dataset/crime_place.csv", index=False)


        # 범죄 관련 책 정제

        df10 = pd.read_csv("./dataset/범최책.csv", encoding='euc-kr', thousands=',')

        del df10["편/권차"]
        del df10["낱권 ISBN"]
        del df10["낱권 부가기호"]
        del df10["세트 ISBN"]
        del df10["세트 부가기호"]
        del df10["CIP 제어번호"]
        del df10["판차"]
        del df10["총서 표제"]
        del df10["총서 편차"]
        del df10["한국십진분류"]
        del df10["듀이십진분류"]
        del df10["납본여부"]
        del df10["출판사홈페이지"]

        df10.columns = ['책제목', '저자', '가격', '발행일', '발행처']

        df10["가격"] = df10["가격"].apply(lambda x: x.replace(',', ''))

        df10 = df10[df10.가격 != "연재가"]
        df10 = df10[df10.가격 != "세트가미정"]
        df10 = df10[df10.가격 != "비매품/무료"]

        df10['가격'] = df10['가격'].astype(int)
        df10['발행일'] = df10['발행일'].astype(str)


        df10.to_csv("./dataset/crime_book.csv", index=False, header=False)


    process()